Courses/7140/Lectures/Design/spec-design.org
# -*- mode: org -*-
# -*- org-export-html-postamble:t; -*-
#+STARTUP:showeverything
#+TITLE: Famous Examples of Spec/Design
#+AUTHOR: Prabhaker Mateti
#+OPTIONS: toc:nil
#+LINK_HOME: ../../
#+LINK_UP: ../../Lectures
#+DESCRIPTION: CS7140 Software Engineering Lecture
#+STYLE: <style> @media screen {BODY {margin: 10%} }</style>
#+BIND: org-export-html-preamble-format (("en" "<a href=\"http://cecs.wright.edu/~pmateti/Courses/7140/\">CS 7140 Advanced Software Engineering</a>"))
#+BIND: org-export-html-postamble-format (("en" "<hr size=1>Copyright &copy; 2013 %e &bull; <a href=\"http://www.wright.edu/~pmateti\">www.wright.edu/~pmateti</a>"))

* Examples of Spec/Design
1. Others and Bertrand Meyer, "How Specifications Change and Why You
   Should Care" [[http://arxiv.org/pdf/1211.4775v2.pdf][PDF]] Jan 2013. Required Reading.
1. In our lectures so far
  1. Telegram
  1. Tabulate Equations
  1. Condense the List of Numbers
  1. pretty printing
  1. Worms
1. Knuth's Common Words Problem

* JavaCard
1. JavaCard is a subset of Java chosen for small memory, weak-CPU, embedded
   devices.  Widely used in SIM cards and ATM cards.
1. http://code.google.com/p/jcml/  Java Card Specification Language based on JML
1. http://www.javacardforum.org/
1. Erik Poll, Joachim van den Berg, Bart Jacobs, 
   "Specification of the JavaCard API in JML"
   http://cs.ru.nl/E.Poll/papers/cardis00.pdf  Recommended Reading.
1. Nestor Catano, Tim Wahls, "Executing JML Specifications of Java
   Card Applications: A Case Study", search for PDF Link, 2009.
   Recommended Reading

* Knuth's Common Words Problem
1. "Given a file of text, and a number k, print the k most common words."
1. Used as an example of Literate Programming
1. Criticized as an example of software development
1. Our interest here:  How to describe its spec + design?
1. Defs of text, words, ...
1. Def of "common" word
1. nary Tries, ...
1. Destructive Traversals
1. Donald E. Knuth, "A Solution to the Common Words Problem",
   Communications of the ACM, 1986, search for PDF link.  Knuth is a
   Turing Award winner. Required Reading.

** N-ary Tries
1. [[http:./cwp-nary-tree.pdf][cwp-nary-tree.pdf]]
1. [[http:./cwp-plain-trie.pdf][cwp-plain-trie.pdf]]
1. [[http:./cwp-ringed-trie.pdf][cwp-ringed-trie.pdf]]
1. [[http:./cwp-hash-trie.pdf][cwp-hash-trie.pdf]]

* References

1. Others and Bertrand Meyer, "How Specifications Change and Why You
   Should Care" [[http://arxiv.org/pdf/1211.4775v2.pdf][PDF]] Jan 2013. Required Reading.

1. Donald E. Knuth, "A Solution to the Common Words Problem",
   Communications of the ACM, 1986, search for PDF link.  Knuth is a
   Turing Award winner. Required Reading.
